## 1. Creación de Dataframes
Casi siempre los dataframes serán importados durante la práctica, en esta ocasión se mostrará cómo crearlos a partir de un diccionario para ilustrar otras funciones útiles

In [2]:
import pandas as pd

In [15]:
df = pd.DataFrame({'Vanesa':[61,23,10,66,65],
                    'Kevin':[89,89,57,90,88],
                    'Fernanda':[59,60,75,460,62],
                    'Patricia':[2,70,68,67,65]})
df

   Vanesa  Kevin  Fernanda  Patricia
0      61     89        59         2
1      23     89        60        70
2      10     57        75        68
3      66     90       460        67
4      65     88        62        65

In [18]:
type(df)

pandas.core.frame.DataFrame

Agregar un **índice**

In [12]:
df.index = ['Periodo 1','Periodo 2','Periodo 3','Periodo 4','Periodo 5']
df

           Vanesa  Kevin  Fernanda  Patricia
Periodo 1      61     89        59         2
Periodo 2      23     89        60        70
Periodo 3      10     57        75        68
Periodo 4      66     90       460        67
Periodo 5      65     88        62        65

El **índice** puede introducirse en la misma función pd.DataFrame

In [20]:
df = pd.DataFrame({'Vanesa':[61,23,10,66,65],
                    'Kevin':[89,89,57,90,88],
                    'Fernanda':[59,60,75,460,62],
                    'Patricia':[2,70,68,67,65]},
                   index = ['Periodo 1','Periodo 2','Periodo 3','Periodo 4','Periodo 5'])
df

           Vanesa  Kevin  Fernanda  Patricia
Periodo 1      61     89        59         2
Periodo 2      23     89        60        70
Periodo 3      10     57        75        68
Periodo 4      66     90       460        67
Periodo 5      65     88        62        65

## 2. Consultar información de un DataFrame

### 2.2. Selección de filas
La selección de filas es el equivalente al uso de filtros sobre una tabla de datos

In [29]:
# Uso del método loc para filtrar el índice "Periodo 3"
# El método loc usa el nombre de los índices para recoger información 
df.loc["Periodo 3"]

Vanesa      10
Kevin       57
Fernanda    75
Patricia    68
Name: Periodo 3, dtype: int64

In [30]:
# Uso de la función iloc para filtrar la tercera fila
# El método iloc usa el número de índice para recoger información
df.iloc[2]

Vanesa      10
Kevin       57
Fernanda    75
Patricia    68
Name: Periodo 3, dtype: int64

In [66]:
# Filtrar desde la primera a la tercera fila del dataframe
df.iloc[0:3]

           Vanesa  Kevin  Fernanda  Patricia
Periodo 1      61     89        59         2
Periodo 2      23     89        60        70
Periodo 3      10     57        75        68

In [67]:
# Filtrar solamente la primera y la tercera fila del dataframe
df.iloc[[0,2]]

           Vanesa  Kevin  Fernanda  Patricia
Periodo 1      61     89        59         2
Periodo 3      10     57        75        68

### 2.2. Aplicación de filtro y selección con criterios lógicos

In [70]:
# Conservar aquellos valores de la tabla que sean mayores a 70
# Nótese que los campos con "NaN" son campos vacios
df[df>=70]

           Vanesa  Kevin  Fernanda  Patricia
Periodo 1     NaN   89.0       NaN       NaN
Periodo 2     NaN   89.0       NaN      70.0
Periodo 3     NaN    NaN      75.0       NaN
Periodo 4     NaN   90.0     460.0       NaN
Periodo 5     NaN   88.0       NaN       NaN

In [72]:
# Conservar aquellos valores de la tabla que se encuentren entre 65 y 80
# Nótese que los campos con "NaN" son campos vacios
df[(df>=65) & (df<=80)]

           Vanesa  Kevin  Fernanda  Patricia
Periodo 1     NaN    NaN       NaN       NaN
Periodo 2     NaN    NaN       NaN      70.0
Periodo 3     NaN    NaN      75.0      68.0
Periodo 4    66.0    NaN       NaN      67.0
Periodo 5    65.0    NaN       NaN      65.0

### 2.3. Selección de columnas

In [73]:
# Selección de una columna 
df["Vanesa"]

Periodo 1    61
Periodo 2    23
Periodo 3    10
Periodo 4    66
Periodo 5    65
Name: Vanesa, dtype: int64

In [23]:
# Selección de una columna como atributo
df.Vanesa

Periodo 1    61
Periodo 2    23
Periodo 3    10
Periodo 4    66
Periodo 5    65
Name: Vanesa, dtype: int64

In [28]:
# Selección de varias columnas
df[["Vanesa","Kevin"]]

           Vanesa  Kevin
Periodo 1      61     89
Periodo 2      23     89
Periodo 3      10     57
Periodo 4      66     90
Periodo 5      65     88

### 2.4. Selección de columnas con criterios lógicos

(Pendiente)

### 2.3. Selección de filas y columnas simultáneamente

In [55]:
# Filtrar desde la segunda hasta la tercera fila de las columnas de Vanesa y Patricia
# El filtro se hace por fila y columna
df.iloc[1:3,[0,3]]

           Vanesa  Patricia
Periodo 2      23        70
Periodo 3      10        68

In [58]:
# Filtrar desde la segunda hasta la tercera fila de las columnas de Vanesa y Patricia
# El filtro se hace por fila y columna
df.loc["Periodo 2":"Periodo 3",["Vanesa","Patricia"]]

           Vanesa  Patricia
Periodo 2      23        70
Periodo 3      10        68